import streamlit as st
import plotly.express as px
import pandas as pd

st.title('壢商升學小助手')

# Sidebar 選單
choice = st.sidebar.selectbox(
    "選擇操作", ['108~112登分各招生群(類)別錄取人數長條圖','108~112甄選商科錄取人數長條圖']
)

# 創建示例 DataFrame
data = {
    '錄取人數': ['09商業與管理群', '17餐旅群', '04電機與電子群資電類', '07設計群',
                '01機械群', '15外語群英語類', '03電機與電子群電機類', '13家政群生活應用類',
                '02動力機械群', '10衛生與護理類', '14農業群', '12家政群幼保類',
                '06土木與建築群', '16外語群日語類', '20藝術群影視類', '11食品群',
                '05化工群', '08工程與管理類', '19水產群', '18海事群','招生群(類)別'],
    '錄取人數總和': ['01機械群', '02動力機械群', '03電機與電子群電機類', '04電機與電子群資電類',
                '05化工群', '06土木與建築群', '07設計群', '08工程與管理類',
                '09商業與管理群', '10衛生與護理類', '11食品群', '12家政群幼保類',
                '13家政群生活應用類', '14農業群', '15外語群英語類',
                '16外語群日語類', '17餐旅群', '18海事群', '19水產群','20藝術群影視類','招生群(類)別']
}

    
# 錄取人數次數
counts = [2499, 1774, 1287, 1093, 975, 870, 812, 648, 561, 422, 346, 292, 290, 274, 265, 242, 196, 87, 37, 25,4]
counts1 = [10382, 3944, 7333, 11488, 2283, 2750, 10455, 348, 25157, 3907, 1615, 2123, 3911, 2379, 5855, 1610, 14744, 84, 222, 1042,0]

# 根據選擇的操作繪製圖表
if choice == '108~112登分各招生群(類)別錄取人數長條圖':
    new_df2 = pd.DataFrame({'錄取人數': data['錄取人數'], '次數': counts})
    fig = px.bar(new_df2, x='錄取人數', y='次數', title='108~112錄取人數長條圖')
    st.plotly_chart(fig)    
    # 如果有不同的數據，可以在這裡創建另一個 DataFrame
    new_df2 = pd.DataFrame({ '錄取人數總和': counts1,'招生群(類)別': data['錄取人數總和']})
    fig = px.bar(new_df2, x='招生群(類)別', y='錄取人數總和', title='各招生群(類)別錄取人數總和')
    st.plotly_chart(fig)
elif choice == '108~112甄選商科錄取人數長條圖':
    pass